saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Toshiba.TXZ4-M4G_DFP.1.0.1.pdsc
          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="6"/>
          <feature type="I2C"           n="5"                           name="I2C"/>
          <feature type="ADC"           n="24"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="155"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100" name="LQFP 100 14x14x0.5"/>
        </device>
        <!-- ***********************  Device 'TMPM4G6FEx'  ************************* -->
        <device Dname="TMPM4G6FEFG">
          <processor Dclock="160000000"/>
          <compile header="Device/Include/TMPM4G6.h" define="TMPM4G6"/>
          <debug svd="SVD/M4G6.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x000C0000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Gx_code_768.FLM" start="0x00000000" size="0x000C0000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Gx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <!--book name=""/-->

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="6"/>
          <feature type="I2C"           n="5"                           name="I2C"/>
          <feature type="ADC"           n="24"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="155"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100" name="LQFP 100 14x14x0.5"/>
        </device>
        <!-- ***********************  Device 'TMPM4G6FDx'  ************************* -->
        <device Dname="TMPM4G6FDFG">
          <processor Dclock="160000000"/>
          <compile header="Device/Include/TMPM4G6.h" define="TMPM4G6"/>
          <debug svd="SVD/M4G6.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Gx_code_512.FLM" start="0x00000000" size="0x00080000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Gx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <!--book name=""/-->

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="6"/>
          <feature type="I2C"           n="5"                           name="I2C"/>
          <feature type="ADC"           n="24"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="155"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100" name="LQFP 100 14x14x0.5"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="TMPM4Gx Compiler">
      <accept condition="Compiler ARMCC"/>
      <accept condition="Compiler IAR"/>   
    </condition>

    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM4G9x CMSIS">
      <description>Toshiba TMPM4G9x Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4G9*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4G8x CMSIS">
      <description>Toshiba TMPM4G8x Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4G8*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4G7x CMSIS">
      <description>Toshiba TMPM4G7x Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4G7*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4G6x CMSIS">
      <description>Toshiba TMPM4G6x Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4G6*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>

    <!-- Startup TMPM4G9x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="TMPM4G9x CMSIS">
      <description>System Startup for Toshiba TMPM4G9x Devices</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_TMPM4G9x      /* Device Startup for TMPM4G9x */
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Gx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4G9.s" attr="config" version="0.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4G9.s" attr="config" version="0.0.1" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Gx.c"      attr="config" version="0.0.1" condition="TMPM4Gx Compiler"/>
      </files>
    </component>
    <!-- Startup TMPM4G8x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="TMPM4G8x CMSIS">
      <description>System Startup for Toshiba TMPM4G8x Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Gx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4G8.s" attr="config" version="0.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4G8.s" attr="config" version="0.0.1" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Gx.c"      attr="config" version="0.0.1" condition="TMPM4Gx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4G7x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="TMPM4G7x CMSIS">
      <description>System Startup for Toshiba TMPM4G7x Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Gx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4G7.s" attr="config" version="0.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4G7.s" attr="config" version="0.0.1" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Gx.c"      attr="config" version="0.0.1" condition="TMPM4Gx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4G6x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="TMPM4G6x CMSIS">
      <description>System Startup for Toshiba TMPM4G6x Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Gx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4G6.s" attr="config" version="0.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4G6.s" attr="config" version="0.0.1" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Gx.c"      attr="config" version="0.0.1" condition="TMPM4Gx Compiler"/>
      </files>
    </component>

  </components>

</package>
